app/controllers/coupons_controller.rb

SELECT `coupons`.* FROM `coupons`
DELETE FROM `coupons` WHERE `coupons`.`id` = 5
---
	def remove
		@coupons = Coupon.all
		@coupons && @coupons.each do |coupon|
			if coupon.subscriber_email.blank?
				coupon.destroy