app/controllers/mc_keys_controller.rb

SELECT `mc_keys`.* FROM `mc_keys` LIMIT 1
SELECT `webhooks`.* FROM `webhooks` LIMIT 1
SELECT `resubscribes`.* FROM `resubscribes` LIMIT 1
---
	def index
		@mc_key = McKey.first
		if params[:list_loaded].present?
			@listloaded = params[:list_loaded]
			@key = params[:key]
			puts @key
		end
		if Webhook.first.present?
			@webhook = Webhook.first
		else
			@webhook = Webhook.new
		end

		@resubscribe = Resubscribe.first

SELECT `mc_keys`.* FROM `mc_keys` LIMIT 1
---
	def load_list
		if params[:key].present?

INSERT INTO `mc_keys` (`created_at`, `key`, `list`, `list_name`, `updated_at`) VALUES ('2013-12-31 12:57:32', '311ed80e059f938b88824488ac9c917c-us4', '19288c1003', 'p8p', '2013-12-31 12:57:32')
---
	def create
		@mc_key = McKey.new(params[:mc_key])
		puts params[:key]
		puts params[:mc_key][:list]
		@list_name = search_list_name(params[:mc_key][:list],params[:mc_key][:key])
		@mc_key.list_name = @list_name
		@mc_key.save!

SELECT `mc_keys`.* FROM `mc_keys` WHERE `mc_keys`.`id` = 4 LIMIT 1
UPDATE `mc_keys` SET `list_name` = 'ereader', `updated_at` = '2014-01-01 07:28:10' WHERE `mc_keys`.`id` = 5
---
	def update
		@mc_key = McKey.find(params[:id])
		@mc_key.update_attributes(params[:mc_key])