app/controllers/resubscribes_controller.rb

	def create
		@resubscribe = Resubscribe.new(params[:resubscribe])
		@resubscribe.save!
---
INSERT INTO `resubscribes` (`created_at`, `re_subscribe`, `updated_at`) VALUES ('2014-01-01 10:49:36', 1, '2014-01-01 10:49:36')

	def update
		@resubscribe = Resubscribe.find(params[:id])
		@resubscribe.update_attributes(params[:resubscribe])
---
SELECT `resubscribes`.* FROM `resubscribes` WHERE `resubscribes`.`id` = 1 LIMIT 1
UPDATE `resubscribes` SET `re_subscribe` = 1, `updated_at` = '2014-01-01 10:30:12' WHERE `resubscribes`.`id` = 1