app/controllers/webhooks_controller.rb

INSERT INTO `webhooks` (`created_at`, `updated_at`, `url`) VALUES ('2013-12-30 15:36:42', '2013-12-30 15:36:42', 'http://clients.chimpchamp.com/p8p/webhooks/webhooks.php')
---
	def create
		@webhook = Webhook.new(params[:webhook])
		@webhook.save!

SELECT `mc_keys`.* FROM `mc_keys` LIMIT 1
SELECT `resubscribes`.* FROM `resubscribes` LIMIT 1
---
	def index    #========= this function called by webhook response from MailChimp

		@mc_key = McKey.first
		gb = Gibbon::API.new(@mc_key.key)
        Gibbon::API.api_key = @mc_key.key
        Gibbon::API.timeout = 15
        Gibbon::API.throws_exceptions = false
        @email = "faisal.bhatti@devsinc.com"   #get email from webhook response params
        options = Array.new
        flag = Gibbon::API.lists.merge_var_add(:id => @mc_key.list, :tag=>"COUPON", :name=>"coupon", :options=> options)
        flag = Gibbon::API.lists.merge_var_add(:id => @mc_key.list, :tag=>"USED", :name=>"used", :options=> options)

        response = EmailChecking(@email)   #this email get from params
        if response.blank?	# if email id does not exist in DB then we assign a coupon
        	response = main_function(@mc_key,@email)
        	if response == true
	    		flash[:notice] = "Process Successfully."
	    		puts "Successfull"
	    		#  ============ redirect path
	    	end
        else           # if email exist and can we assign another token or not.
        	@re_subscribe = Resubscribe.first